while True:

    t = input("Введите: 'C' - Цельсий, 'F' - Фаренгейт, 'K' - Кельвин, 'Q' - выход: ").lower()
    if t == 'q':
        print("Выход из программы.")
        break
    try:

        znach = float(input("Введите значение температуры: "))
        if t == "c":
            print(f'\nТемпература в Фаренгейтах = {(znach * 9/5) + 32:.2f} F')
            print(f'Температура в Кельвинах = {znach + 273.15:.2f} K\n')
        elif t == "f":
            print(f'\nТемпература в Цельсиях = {((znach - 32) * 5/9):.2f} C')
            print(f'Температура в Кельвинах = {(((znach - 32) * 5/9) + 273.15):.2f} K\n')
        elif t == "k":
            print(f'\nТемпература в Цельсиях = {(znach - 273.15):.2f} C')
            print(f'Температура в Фаренгейтах = {(((znach - 273.15) * 9/5) + 32):.2f} F\n')
        else:
            print("Ошибка ввода! Введите только 'C', 'F', 'K' или 'Q'.\n")

    except ValueError:
        print("Ошибка: введите числовое значение температуры.\n")